app/views/user/index.html.erb

                <td>
                <%= order.user.name %> has created an <%= link_to 'Order', order_path(order) %> for <%= order.order_for %> from <%= order.restaurant %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1