app/controllers/friend_controller.rb

  def friends_index
    @friends = User.joins("INNER JOIN friends ON users.id = friends.friend_id")
                      .where("friends.user_id"=> current_user.id);
---
SELECT `users`.* FROM `users` INNER JOIN friends ON users.id = friends.friend_id WHERE `friends`.`user_id` = 1

  def add_friend
    @user = User.find_by(email: params[:email][:email])
    @friend = Friend.new(user_id: current_user.id, friend_id: @user.id )
    if( @friend.user_id == @friend.friend_id)
      redirect_to friends_path, notice: "You can't add your self"
    elsif @friend.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'n@n.n' LIMIT 1
INSERT INTO `friends` (`user_id`, `friend_id`, `created_at`, `updated_at`) VALUES (1, 5, '2020-04-07 23:29:40.060221', '2020-04-07 23:29:40.060221')

  def remove_friend
    friend = Friend.find_by(friend_id: params[:format])
    if friend.destroy
---
SELECT `friends`.* FROM `friends` WHERE `friends`.`friend_id` = 5 LIMIT 1
DELETE FROM `friends` WHERE `friends`.`id` = 4