app/controllers/orders_controller.rb

  def index
    @user_id = current_user.id
    @orders = current_user.orders
---
SELECT `orders`.* FROM `orders`

  def create
    @order= User.find(current_user.id).orders.create(order_params)
---
INSERT INTO `orders` (`order_for`, `restaurant`, `user_id`, `invited`, `created_at`, `updated_at`) VALUES ('', 'new', 1, 0, '2020-04-08 12:50:04.990950', '2020-04-08 12:50:04.990950')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @order = Order.find(params[:id])
    @order.status = 1
    @order.save
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
UPDATE `orders` SET `orders`.`status` = 2, `orders`.`updated_at` = '2020-04-11 05:26:39.228903' WHERE `orders`.`id` = 1