app/models/user.rb

  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO `users` (`name`, `email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`) VALUES ('Mahmoud Elbasha', 'modyelbasha2014@gmail.com', '$2a$11$k3KWg20loP9qm1BPDDGTAuCaGCq.ZSYU8Kdvh.zyrPP0UIzw9gAOi', '2020-04-09 21:56:24.613792', '2020-04-09 21:56:24.613792', 'facebook', '1596217220529567')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'facebook' AND `users`.`uid` = '1596217220529567' ORDER BY `users`.`id` ASC LIMIT 1